In [ ]:
import numpy as np
import pandas as pd

#Creating Dataframe Objects

In [ ]:
arr = np.random.randint(0, 10, (5, 3))
arr

array([[9, 5, 8],
       [1, 7, 3],
       [1, 9, 8],
       [4, 0, 2],
       [1, 3, 0]])

In [ ]:
df = pd.DataFrame(arr)
df          #it has names for both rows and columns

   0  1  2
0  9  5  8
1  1  7  3
2  1  9  8
3  4  0  2
4  1  3  0

In [ ]:
df.values

array([[9, 5, 8],
       [1, 7, 3],
       [1, 9, 8],
       [4, 0, 2],
       [1, 3, 0]])

In [ ]:
df.index    #give rows name

RangeIndex(start=0, stop=5, step=1)

In [ ]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [ ]:
for c in df.columns:
  print(c)

0
1
2

In [ ]:
df.values[0]   #gives first row

array([9, 5, 8])

In [ ]:
df.index = ['R1', 'R2', 'R3', 'R4', 'R5']
df.columns = ['C1', 'C2', 'C3']
df

    C1  C2  C3
R1   9   5   8
R2   1   7   3
R3   1   9   8
R4   4   0   2
R5   1   3   0

In [ ]:
df.loc['R3', 'C2']

9

In [ ]:
df.iloc[2, 1]

9

In [ ]:
df.iloc[2:4, 1:3]

    C2  C3
R3   9   8
R4   0   2

In [ ]:
type(df.iloc[2:4, 1:3])

pandas.core.frame.DataFrame

In [ ]:
df.iloc[0]

C1    9
C2    5
C3    8
Name: R1, dtype: int64

In [ ]:
type(df.iloc[0])          #so, dataframe are collection of series, along every axis

pandas.core.series.Series

In [ ]:
df.iloc[:, 0]

R1    9
R2    1
R3    1
R4    4
R5    1
Name: C1, dtype: int64

In [ ]:
df.shape

(5, 3)

In [ ]:
df.T

    R1  R2  R3  R4  R5
C1   9   1   1   4   1
C2   5   7   9   0   3
C3   8   3   8   2   0

**Task on creating dataframe**

In [ ]:
def create_df(nRows, nCols, maxRand= 10):
  arr = np.random.randint(0, maxRand, (nRows, nCols))
  df = pd.DataFrame(arr)
  df.index = ['R' + str(x) for x in np.arange(1, nRows + 1)]
  df.columns = ['C' + str(x) for x in np.arange(1, nCols + 1)]
  #print(df)
  return df

In [ ]:
create_df(4, 5)

    C1  C2  C3  C4  C5
R1   1   6   5   3   6
R2   9   9   4   5   8
R3   3   5   6   1   8
R4   9   8   4   9   1

In [ ]:
diameter = pd.Series([4878, 12104, 12756, 3475, 6792, 142984, 120536, 51118, 49528, 2370],
                     index= ['Mercury', 'Venus', 'Earth', 'Moon', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])
mass = pd.Series([0.33, 4.87, 5.97, 0.7346, 0.642, 1898, 568, 86.8, 102, 0.0146], 
                 index= ['Mercury', 'Venus', 'Earth', 'Moon', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])

In [ ]:
mass

Mercury       0.3300
Venus         4.8700
Earth         5.9700
Moon          0.7346
Mars          0.6420
Jupiter    1898.0000
Saturn      568.0000
Uranus       86.8000
Neptune     102.0000
Pluto         0.0146
dtype: float64

In [ ]:
diameter

Mercury      4878
Venus       12104
Earth       12756
Moon         3475
Mars         6792
Jupiter    142984
Saturn     120536
Uranus      51118
Neptune     49528
Pluto        2370
dtype: int64

In [ ]:
df = pd.DataFrame({'Mass': mass, 'Diameter': diameter})     #this fn is ovverloaded as it can take many type of object - array, dict, etc.
df      #for empty values, it will take NaN

              Mass  Diameter
Mercury     0.3300      4878
Venus       4.8700     12104
Earth       5.9700     12756
Moon        0.7346      3475
Mars        0.6420      6792
Jupiter  1898.0000    142984
Saturn    568.0000    120536
Uranus     86.8000     51118
Neptune   102.0000     49528
Pluto       0.0146      2370

In [ ]:
df['Mass']

Mercury       0.3300
Venus         4.8700
Earth         5.9700
Moon          0.7346
Mars          0.6420
Jupiter    1898.0000
Saturn      568.0000
Uranus       86.8000
Neptune     102.0000
Pluto         0.0146
Name: Mass, dtype: float64

In [ ]:
df['Mass']['Earth']

5.97

In [ ]:
df.Mass.Earth

5.97

In [ ]:
df['pop'] = 0      #creating new col to df
df

              Mass  Diameter  pop
Mercury     0.3300      4878    0
Venus       4.8700     12104    0
Earth       5.9700     12756    0
Moon        0.7346      3475    0
Mars        0.6420      6792    0
Jupiter  1898.0000    142984    0
Saturn    568.0000    120536    0
Uranus     86.8000     51118    0
Neptune   102.0000     49528    0
Pluto       0.0146      2370    0

In [ ]:
df['pop']['Earth'] = 8000000000000
df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

              Mass  Diameter            pop
Mercury     0.3300      4878              0
Venus       4.8700     12104              0
Earth       5.9700     12756  8000000000000
Moon        0.7346      3475              0
Mars        0.6420      6792              0
Jupiter  1898.0000    142984              0
Saturn    568.0000    120536              0
Uranus     86.8000     51118              0
Neptune   102.0000     49528              0
Pluto       0.0146      2370              0

In [ ]:
df['Mass'] is df.Mass

True

In [ ]:
df['pop'] is df.pop     #df.pop is inbuilt fn, so it is taking that

False

In [ ]:
df.loc['Earth']          #gives detail of a row

Mass        5.970000e+00
Diameter    1.275600e+04
pop         8.000000e+12
Name: Earth, dtype: float64

In [ ]:
df.loc[:, 'Mass']

Mercury       0.3300
Venus         4.8700
Earth         5.9700
Moon          0.7346
Mars          0.6420
Jupiter    1898.0000
Saturn      568.0000
Uranus       86.8000
Neptune     102.0000
Pluto         0.0146
Name: Mass, dtype: float64

In [ ]:
df.drop('pop', axis= 1, inplace= True)    #inplace makes sure that it is deleted from the original df
df

              Mass  Diameter
Mercury     0.3300      4878
Venus       4.8700     12104
Earth       5.9700     12756
Moon        0.7346      3475
Mars        0.6420      6792
Jupiter  1898.0000    142984
Saturn    568.0000    120536
Uranus     86.8000     51118
Neptune   102.0000     49528
Pluto       0.0146      2370

##Creating Mean Row

In [ ]:
def create_mean_row(df):
  df.loc['Mean'] = df.mean()
  # df.loc['Mean'] = [np.mean(df[col]) for col in df.columns]       #also not the best way
  # df.loc['Mean'] = [np.mean(df['Mass']), np.mean(df['Diameter'])]     #not the best way
  # df['Mass']['Mean'] = np.mean(mass)
  # df['Diameter']['Mean'] = np.mean(diameter)
  # df['pop']['Mean'] = np.mean(df.pop)
  return df

In [ ]:
create_mean_row(df)

               Mass  Diameter
Mercury     0.33000    4878.0
Venus       4.87000   12104.0
Earth       5.97000   12756.0
Moon        0.73460    3475.0
Mars        0.64200    6792.0
Jupiter  1898.00000  142984.0
Saturn    568.00000  120536.0
Uranus     86.80000   51118.0
Neptune   102.00000   49528.0
Pluto       0.01460    2370.0
Mean      266.73612   40654.1

In [ ]:
df1 = create_df(5, 3)
df1

    C1  C2  C3
R1   1   0   0
R2   9   5   0
R3   3   9   4
R4   2   2   2
R5   8   4   5

In [ ]:
df1.mean()

C1    4.6
C2    4.0
C3    2.2
dtype: float64

In [ ]:
df1.mean(axis= 1)

R1    0.333333
R2    4.666667
R3    5.333333
R4    2.000000
R5    5.666667
dtype: float64

In [ ]:
df1['Row_Mean'] = df1.mean(axis = 1)
df1.loc['Col_Mean'] = df1.mean()
df1

           C1   C2   C3  Row_Mean
R1        1.0  0.0  0.0  0.333333
R2        9.0  5.0  0.0  4.666667
R3        3.0  9.0  4.0  5.333333
R4        2.0  2.0  2.0  2.000000
R5        8.0  4.0  5.0  5.666667
Col_Mean  4.6  4.0  2.2  3.600000

In [ ]:
df.drop('Col_Mean', inplace = True)
df.drop('Row_Mean', axis= 1, inplace= True)
df

               Mass  Diameter
Mercury     0.33000    4878.0
Venus       4.87000   12104.0
Earth       5.97000   12756.0
Moon        0.73460    3475.0
Mars        0.64200    6792.0
Jupiter  1898.00000  142984.0
Saturn    568.00000  120536.0
Uranus     86.80000   51118.0
Neptune   102.00000   49528.0
Pluto       0.01460    2370.0
Mean      266.73612   40654.1

In [ ]:
df1.max()

C1          9.000000
C2          9.000000
C3          5.000000
Row_Mean    5.666667
dtype: float64

In [ ]:
df1.median()

C1          3.800000
C2          4.000000
C3          2.100000
Row_Mean    4.133333
dtype: float64

In [ ]:
df1.drop('Row_Mean', axis= 1, inplace= True)

In [ ]:
df1.quantile()

C1    3.8
C2    4.0
C3    2.1
Name: 0.5, dtype: float64

In [ ]:
df1.describe()

             C1       C2        C3
count  6.000000  6.00000  6.000000
mean   4.600000  4.00000  2.200000
std    3.261901  3.03315  2.039608
min    1.000000  0.00000  0.000000
25%    2.250000  2.50000  0.500000
50%    3.800000  4.00000  2.100000
75%    7.150000  4.75000  3.550000
max    9.000000  9.00000  5.000000

In [ ]:
df.describe()        #for planets data

              Mass       Diameter
count    11.000000      11.000000
mean    266.736120   40654.100000
std     568.466805   48896.530365
min       0.014600    2370.000000
25%       0.688300    5835.000000
50%       5.970000   12756.000000
75%     184.368060   50323.000000
max    1898.000000  142984.000000

##Working with Planetary Dataset

In [ ]:
import seaborn as sns     #for visualization, and to get pre-given datasets

In [ ]:
df = sns.load_dataset('planets')       #read from google more for this, in-built

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [ ]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [ ]:
df.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [ ]:
df.describe()         #works only on numerical columns

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

##Droping Null Values

Go through each row of the dataframe and delete it (drop) if any column of it is null.

In [ ]:
for r in df.index:               #non efficient way
  for c in df.columns:
    if pd.isnull(df.loc[r, c]):
      df.drop(r, inplace= True)
      break                 #as that row is deleted, there is no way to check for other columns of this row

In [ ]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [ ]:
for i, r in df.iterrows():
  print(i)     #i is row no.
  print(r)     #r give rows values
  break        #to see only for one row

0
method            Radial Velocity
number                          1
orbital_period              269.3
mass                          7.1
distance                     77.4
year                         2006
Name: 0, dtype: object

In [ ]:
for i, r in df.iterrows():            #another non-efficient, but smaller way
  if(pd.isnull(r).any()):
    df.drop(i, inplace= True)

In [ ]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [ ]:
df.dropna(inplace= True)            #best way to remove rows with missing values
#it will drop rows which has 'na', not a number
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

##Queryiyng from DataFrame

Filter and show only those rows which have planets that are found in the 2010s and method is 'Radial Velocity' and 'Transit' and distance is large (> 75 percentile).

In [ ]:
df_ = df.copy()      #not the  best way
per_75 = df.distance.quantile(0.75)
for i, r in df_.iterrows():
  if r['year'] < 2010:
    df_.drop(i, inplace= True)
    continue
  if (r['method'] != 'Radial Velocity' and r['method'] != 'Transit'):
    df_.drop(i, inplace= True)
    continue
  if (r['distance'] < per_75):
    df_.drop(i, inplace= True)
    continue

In [ ]:
df_.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

In [ ]:
df_ = df.copy()        #efficient way for the same query
df_ = df_[
        (df_['year'] >= 2010) &
        ((df_['method'] == 'Radial Velocity') | (df_['method'] == 'Transit')) &
        (df_['distance'] > per_75)
    ]
df_

              method  number  orbital_period    mass  distance  year
9    Radial Velocity       2       452.80000   1.990     74.79  2010
10   Radial Velocity       2       883.00000   0.860     74.79  2010
58   Radial Velocity       1       277.02000   1.700     80.64  2013
63   Radial Velocity       1       305.50000  20.600     92.51  2013
84   Radial Velocity       1       137.48000   1.110    175.44  2013
166  Radial Velocity       2      5584.00000   3.400     90.00  2010
181  Radial Velocity       2      1022.00000   3.400    354.00  2011
202  Radial Velocity       1       431.80000   3.100    167.50  2011
206  Radial Velocity       1       311.60000   1.600    115.21  2013
218  Radial Velocity       1       177.11000   7.600    150.60  2011
248  Radial Velocity       2        19.38200   0.865     66.89  2013
249  Radial Velocity       2       931.00000   5.130     66.89  2013
257  Radial Velocity       1       772.00000   2.700    127.88  2011
282  Radial Velocity       1       387.10000   1.700    168.92  2011
285  Radial Velocity       1       912.00000   1.800    121.07  2011
290  Radial Velocity       1       326.60000   1.300    136.80  2011
349  Radial Velocity       1       480.50000   6.000     80.06  2012
376  Radial Velocity       1       705.00000   1.300    112.23  2011
394  Radial Velocity       1       361.10000   0.900    132.80  2011
396  Radial Velocity       1       647.30000   4.000    221.24  2011
400  Radial Velocity       1       436.90000   1.800    150.38  2011
405  Radial Velocity       1       868.00000   1.400    130.89  2011
406  Radial Velocity       1       157.57000   1.700    140.85  2011
414  Radial Velocity       1       778.10000   5.900    138.50  2011
415  Radial Velocity       1         6.49500   0.960    121.07  2010
421  Radial Velocity       1      2890.00000  11.000     87.87  2011
426  Radial Velocity       1       443.40000   2.600    138.50  2011
429  Radial Velocity       1        68.27000   0.770     65.62  2010
444  Radial Velocity       1       670.00000   2.100    110.62  2011
448  Radial Velocity       1      2082.00000   4.500     97.66  2013
461  Radial Velocity       1       883.00000   2.200    121.36  2011
464  Radial Velocity       1      1544.00000   1.490     98.52  2011
480  Radial Velocity       1      1299.00000   1.900    106.38  2011
483  Radial Velocity       1       176.30000   2.900    126.10  2010
495  Radial Velocity       1       689.00000   1.500    182.82  2011
501  Radial Velocity       2      3452.00000   2.580     68.54  2014
509  Radial Velocity       1       521.00000   1.800    114.15  2011
510  Radial Velocity       2        12.62000   1.130     68.59  2013
511  Radial Velocity       2       248.40000   1.900     68.59  2013
519  Radial Velocity       2        75.29000   0.770     69.44  2010
520  Radial Velocity       2      1314.00000   2.290     69.44  2010
573  Radial Velocity       2       613.80000   1.850     68.35  2010
574  Radial Velocity       2       825.00000   0.895     68.35  2010
587  Radial Velocity       1       875.50000   9.900    352.11  2012
610  Radial Velocity       1       672.10000  11.100    289.02  2012
620  Radial Velocity       1       745.70000   5.300    307.69  2011
627  Radial Velocity       1        16.20000   1.250    223.21  2010
636  Radial Velocity       1       124.60000   9.180    149.25  2013
649          Transit       1         2.70339   1.470    178.00  2013
784  Radial Velocity       3       580.00000   0.947    135.00  2012

In [ ]:
df_.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

##Applying Functions to DataFrame

Modify the method column to have only the abbreviation of each method.

In [ ]:
df.method.unique()    #tells all unique value

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [ ]:
s = 'Radial Velocity'
''.join([x[0] for x in s.split(' ')])  #returns string with the first char of each string

'RV'

In [ ]:
short_names = {}
for s in df.method.unique():
  short_names[s] = ''.join([x[0] for x in s.split(' ')])

short_names

{'Astrometry': 'A',
 'Eclipse Timing Variations': 'ETV',
 'Imaging': 'I',
 'Microlensing': 'M',
 'Orbital Brightness Modulation': 'OBM',
 'Pulsar Timing': 'PT',
 'Pulsation Timing Variations': 'PTV',
 'Radial Velocity': 'RV',
 'Transit': 'T',
 'Transit Timing Variations': 'TTV'}

In [ ]:
for i, r in df.iterrows():                             #not the best way
  df.loc[i, 'short_method'] = short_names.get(r['method'], r['method'])

In [ ]:
df.head()

            method  number  orbital_period   mass  distance  year short_method
0  Radial Velocity       1         269.300   7.10     77.40  2006           RV
1  Radial Velocity       1         874.774   2.21     56.95  2008           RV
2  Radial Velocity       1         763.000   2.60     19.84  2011           RV
3  Radial Velocity       1         326.030  19.40    110.62  2007           RV
4  Radial Velocity       1         516.220  10.50    119.47  2009           RV

In [ ]:
df.tail()

       method  number  orbital_period  mass  distance  year short_method
1030  Transit       1        3.941507   NaN     172.0  2006            T
1031  Transit       1        2.615864   NaN     148.0  2007            T
1032  Transit       1        3.191524   NaN     174.0  2007            T
1033  Transit       1        4.125083   NaN     293.0  2008            T
1034  Transit       1        4.187757   NaN     260.0  2008            T

In [ ]:
def shorten_names(s):
  return short_names.get(s, s)

In [ ]:
df['short_names'] = df['method'].apply(shorten_names)       #efficient way
df.head()

            method  number  orbital_period   mass  distance  year short_names
0  Radial Velocity       1         269.300   7.10     77.40  2006          RV
1  Radial Velocity       1         874.774   2.21     56.95  2008          RV
2  Radial Velocity       1         763.000   2.60     19.84  2011          RV
3  Radial Velocity       1         326.030  19.40    110.62  2007          RV
4  Radial Velocity       1         516.220  10.50    119.47  2009          RV

##Use of Groupby Method

Count the number of planets discovered for each method type.

1. **Split** the dataframe into smaller chunks (in this case, they should have same method name).

2. **Apply** some function in each smaller chunk (in this case, it is the count function).

3. **Aggregate** the result from each chunk together.

In [ ]:
d = {}     #to aggregate
for m in df.method.unique():         #not the best way
  #print(m)
  #print(df[df.method == m]['method'].count())
  d[m] = df[df.method == m]['method'].count()     #we want only ['method'] column, so subsetting it
print(d)

{'Radial Velocity': 553, 'Imaging': 38, 'Eclipse Timing Variations': 9, 'Transit': 397, 'Astrometry': 2, 'Transit Timing Variations': 4, 'Orbital Brightness Modulation': 3, 'Microlensing': 23, 'Pulsar Timing': 5, 'Pulsation Timing Variations': 1}

In [ ]:
df.groupby('method')['method'].count()       #most efficicent way
#returns a series object

method
Astrometry                         2
Eclipse Timing Variations          9
Imaging                           38
Microlensing                      23
Orbital Brightness Modulation      3
Pulsar Timing                      5
Pulsation Timing Variations        1
Radial Velocity                  553
Transit                          397
Transit Timing Variations          4
Name: method, dtype: int64

In [ ]:
df.groupby('method')['distance'].mean()       #finding mean distance for each method grp

method
Astrometry                         17.875000
Eclipse Timing Variations         315.360000
Imaging                            67.715937
Microlensing                     4144.000000
Orbital Brightness Modulation    1180.000000
Pulsar Timing                    1200.000000
Pulsation Timing Variations              NaN
Radial Velocity                    51.600208
Transit                           599.298080
Transit Timing Variations        1104.333333
Name: distance, dtype: float64

##Filter, Split, Apply, Aggregate

Find out what fraction of planets have been found in the last decade (i.e., in 2010s) across each method type.

1. **Filter** the data for given condition (in this case, planet found in last decade).

2. **Split** (in this case across method).

3. **Apply** (in this case just count).

4. **Aggregate** (to represent the final result).

In [ ]:
s_2010s = df[df.year >= 2010].groupby('method')['method'].count()

In [ ]:
s_allTime = df.groupby('method')['method'].count()

In [ ]:
s_2010s / s_allTime

method
Astrometry                       1.000000
Eclipse Timing Variations        0.666667
Imaging                          0.473684
Microlensing                     0.565217
Orbital Brightness Modulation    1.000000
Pulsar Timing                    0.200000
Pulsation Timing Variations           NaN
Radial Velocity                  0.388788
Transit                          0.843829
Transit Timing Variations        1.000000
Name: method, dtype: float64

##Working with Nifty50 Dataset

Find a dataset of Nifty numbers from 2018 to 2019 - daily numbers open, close, high, low.

(Downloaded data from: https://www.niftyindices.com/reports/historical-data)

In [ ]:
!unzip /content/Nifty_csv_files-200628-122439.zip

Archive:  /content/Nifty_csv_files-200628-122439.zip
  inflating: NIFTY50_2019.csv
  inflating: NIFTY50_2018.csv
  inflating: NIFTYNext50_2019.csv

In [ ]:
nifty50_2018 = pd.read_csv('NIFTY50_2018.csv')

In [ ]:
nifty50_2018.head()

          Date      Open      High       Low     Close
0  31 Dec 2018  10913.20  10923.55  10853.20  10862.55
1  28 Dec 2018  10820.95  10893.60  10817.15  10859.90
2  27 Dec 2018  10817.90  10834.20  10764.45  10779.80
3  26 Dec 2018  10635.45  10747.50  10534.55  10729.85
4  24 Dec 2018  10780.90  10782.30  10649.25  10663.50

In [ ]:
nifty50_2018 = pd.read_csv('NIFTY50_2018.csv', index_col= 0)   #date became index

In [ ]:
nifty50_2018.head()

                 Open      High       Low     Close
Date
31 Dec 2018  10913.20  10923.55  10853.20  10862.55
28 Dec 2018  10820.95  10893.60  10817.15  10859.90
27 Dec 2018  10817.90  10834.20  10764.45  10779.80
26 Dec 2018  10635.45  10747.50  10534.55  10729.85
24 Dec 2018  10780.90  10782.30  10649.25  10663.50

In [ ]:
nifty50_2018.loc['28 Dec 2018']      #easier to access

Open     10820.95
High     10893.60
Low      10817.15
Close    10859.90
Name: 28 Dec 2018, dtype: float64

In [ ]:
nifty50_2018['Open']

Date
31 Dec 2018    10913.20
28 Dec 2018    10820.95
27 Dec 2018    10817.90
26 Dec 2018    10635.45
24 Dec 2018    10780.90
                 ...
05 Jan 2018    10534.25
04 Jan 2018    10469.40
03 Jan 2018    10482.65
02 Jan 2018    10477.55
01 Jan 2018    10531.70
Name: Open, Length: 246, dtype: float64

In [94]:
nifty50_2019 = pd.read_csv('NIFTY50_2019.csv', index_col= 0)

In [ ]:
nifty50_2019.head()

                 Open      High       Low     Close
Date
31 Dec 2019  12247.10  12247.10  12151.80  12168.45
30 Dec 2019  12274.90  12286.45  12213.80  12255.85
27 Dec 2019  12172.90  12258.45  12157.90  12245.80
26 Dec 2019  12211.85  12221.55  12118.85  12126.55
24 Dec 2019  12269.25  12283.70  12202.10  12214.55

In [ ]:
print(nifty50_2018.shape, nifty50_2019.shape)

(246, 4) (245, 4)

In [ ]:
nifty50 = pd.concat([nifty50_2018, nifty50_2019])

In [ ]:
nifty50.shape

(491, 4)

In [ ]:
niftynext50_2019 = pd.read_csv('NIFTYNext50_2019.csv', index_col= 0)

In [ ]:
niftynext50_2019.head()

                 Open      High       Low     Close
Date
31 Dec 2019  28495.00  28549.50  28270.25  28307.55
30 Dec 2019  28528.95  28612.95  28406.70  28484.85
27 Dec 2019  28354.50  28500.25  28319.90  28476.80
26 Dec 2019  28409.10  28435.25  28259.75  28280.25
24 Dec 2019  28423.70  28430.40  28318.75  28382.85

In [ ]:
nifty_2019 = pd.concat([nifty50_2019, niftynext50_2019], axis= 1)  #to concatenate verrtically

In [ ]:
nifty_2019.shape

(245, 8)

In [ ]:
nifty_2019.head()     #it is giving us heirarchical indexing (two col having same name)

                 Open      High       Low  ...      High       Low     Close
Date                                       ...
31 Dec 2019  12247.10  12247.10  12151.80  ...  28549.50  28270.25  28307.55
30 Dec 2019  12274.90  12286.45  12213.80  ...  28612.95  28406.70  28484.85
27 Dec 2019  12172.90  12258.45  12157.90  ...  28500.25  28319.90  28476.80
26 Dec 2019  12211.85  12221.55  12118.85  ...  28435.25  28259.75  28280.25
24 Dec 2019  12269.25  12283.70  12202.10  ...  28430.40  28318.75  28382.85

[5 rows x 8 columns]

In [ ]:
nifty_2019 = pd.concat([nifty50_2019, niftynext50_2019], axis= 1, keys= ['nifty50', 'niftynext50'])

In [ ]:
nifty_2019.head()

              nifty50                      ... niftynext50
                 Open      High       Low  ...        High       Low     Close
Date                                       ...
31 Dec 2019  12247.10  12247.10  12151.80  ...    28549.50  28270.25  28307.55
30 Dec 2019  12274.90  12286.45  12213.80  ...    28612.95  28406.70  28484.85
27 Dec 2019  12172.90  12258.45  12157.90  ...    28500.25  28319.90  28476.80
26 Dec 2019  12211.85  12221.55  12118.85  ...    28435.25  28259.75  28280.25
24 Dec 2019  12269.25  12283.70  12202.10  ...    28430.40  28318.75  28382.85

[5 rows x 8 columns]

In [ ]:
nifty_2019.shape

(245, 8)

In [ ]:
nifty_2019['nifty50']['Open']    #how to access this object

Date
31 Dec 2019    12247.10
30 Dec 2019    12274.90
27 Dec 2019    12172.90
26 Dec 2019    12211.85
24 Dec 2019    12269.25
                 ...
07 Jan 2019    10804.85
04 Jan 2019    10699.70
03 Jan 2019    10796.80
02 Jan 2019    10868.85
01 Jan 2019    10881.70
Name: Open, Length: 245, dtype: float64

In [ ]:
nifty_2019['nifty50'].loc['31 Dec 2019']

Open     12247.10
High     12247.10
Low      12151.80
Close    12168.45
Name: 31 Dec 2019, dtype: float64

##Tasks on the NIFTY Datasets

1. In 2019, in how many days was the NIFTY50 volatile (high > 105% of low).

2. In 2019, in how many days was the NIFTYNEXT50 volatile (high > 105% of low)

3. In 2019, how many days belonged to the four classes NIFTY50 volatile / non-volatile and NIFTYNext50 volatile / non-volatile

4. Compute the mean, median, std, var of closing values for each weekday in NIFTY50 for 2019

5. Compute the mean, median, std, var of closing values for each month in NIFTY50 for 2019

6. On the days in which NIFTY50 closed higher than the open, what was the mean of (close - open) for NIFTYNext50

7. In 2019, how many days had the day's high lower than the previous day's low in NIFTY50

8. In 2019, on how many days did the day's close exceed the 30 day moving average in NIFTY50 (exclude first month)

In [95]:
#ques1

nifty50_2019['Volatile'] = (nifty50_2019['High'] > (1.05 * nifty50_2019['Low']))

In [ ]:
nifty50_2019.head()

                 Open      High       Low     Close  Volatile
Date
31 Dec 2019  12247.10  12247.10  12151.80  12168.45     False
30 Dec 2019  12274.90  12286.45  12213.80  12255.85     False
27 Dec 2019  12172.90  12258.45  12157.90  12245.80     False
26 Dec 2019  12211.85  12221.55  12118.85  12126.55     False
24 Dec 2019  12269.25  12283.70  12202.10  12214.55     False

In [ ]:
#nifty50_2019['Volatile'].value_counts()     #this will give 
print(len(nifty50_2019[nifty50_2019['Volatile'] == True]))

1

In [ ]:
#ques_2

niftynext50_2019['Volatile'] = (niftynext50_2019['High'] > (1.05 * niftynext50_2019['Low']))
niftynext50_2019['Volatile'].value_counts()

False    244
True       1
Name: Volatile, dtype: int64

In [ ]:
#ques3

print("Nifty50:")
print("Volatile: ", len(nifty50_2019[nifty50_2019['Volatile'] == True]))
print("Non-Volatile: ", len(nifty50_2019[nifty50_2019['Volatile'] == False]))
print("NiftyNext50:")
print("Volatile: ", len(niftynext50_2019[niftynext50_2019['Volatile'] == True]))
print("Non-Volatile: ", len(nifty50_2019[nifty50_2019['Volatile'] == False]))

Nifty50:
Volatile:  1
Non-Volatile:  244
NiftyNext50:
Volatile:  1
Non-Volatile:  244

In [96]:
#ques4

new_index = map(pd.Timestamp, nifty50_2019.index)
nifty50_2019 = pd.DataFrame(nifty50_2019, index= new_index)
nifty50_2019.head()

                Open      High       Low     Close  Volatile
2019-12-31  12247.10  12247.10  12151.80  12168.45     False
2019-12-30  12274.90  12286.45  12213.80  12255.85     False
2019-12-27  12172.90  12258.45  12157.90  12245.80     False
2019-12-26  12211.85  12221.55  12118.85  12126.55     False
2019-12-24  12269.25  12283.70  12202.10  12214.55     False

In [30]:
dow = nifty50_2019.copy()
dow['Day'] = dow.index.dayofweek
dow.head()

                Open      High       Low     Close  Volatile  Day
2019-12-31  12247.10  12247.10  12151.80  12168.45     False    1
2019-12-30  12274.90  12286.45  12213.80  12255.85     False    0
2019-12-27  12172.90  12258.45  12157.90  12245.80     False    4
2019-12-26  12211.85  12221.55  12118.85  12126.55     False    3
2019-12-24  12269.25  12283.70  12202.10  12214.55     False    1

In [43]:
# print("Mean:", dow.groupby('Day')['Close'].mean())
# print("Median:", dow.groupby('Day')['Close'].median())
# print("Standard Deviation:", dow.groupby('Day')['Close'].std())
# print("Variance:", dow.groupby('Day')['Close'].var())

Mean= pd.Series(dow.groupby('Day')['Close'].mean())
Median= pd.Series(dow.groupby('Day')['Close'].median())
StdDev= pd.Series(dow.groupby('Day')['Close'].std())
Variance= pd.Series(dow.groupby('Day')['Close'].var())

# print(Mean, Median, StdDev, Variance)

nifty50_2019_week = pd.DataFrame([Mean, Median, StdDev, Variance])
nifty50_2019_week.index = ['Mean', 'Median', 'StdDev', 'Variance']
nifty50_2019_week
#We are getting 6 (Sunday) as on Diwali, it was Sunday, but Stock Market opened for an hour

Day                   0              1  ...              4         6
Mean       11463.535870   11444.318000  ...   11435.394118  11627.15
Median     11573.475000   11544.150000  ...   11456.900000  11627.15
StdDev       463.019749     462.829541  ...     443.779665       NaN
Variance  214387.288296  214211.183649  ...  196940.391065       NaN

[4 rows x 6 columns]

In [44]:
#ques5

dow = nifty50_2019.copy()
dow['Month'] = dow.index.month_name()
dow.head()

                Open      High       Low     Close  Volatile     Month
2019-12-31  12247.10  12247.10  12151.80  12168.45     False  December
2019-12-30  12274.90  12286.45  12213.80  12255.85     False  December
2019-12-27  12172.90  12258.45  12157.90  12245.80     False  December
2019-12-26  12211.85  12221.55  12118.85  12126.55     False  December
2019-12-24  12269.25  12283.70  12202.10  12214.55     False  December

In [66]:
# df_= nifty50_2019.groupby([pd.Timestamp(i).month_name() for i in nifty50_2019.index[:]])[‘Close’].mean()
#easy way to do this
Mean= pd.Series(dow.groupby('Month')['Close'].mean())
Median= pd.Series(dow.groupby('Month')['Close'].median())
StdDev= pd.Series(dow.groupby('Month')['Close'].std())
Variance= pd.Series(dow.groupby('Month')['Close'].var())

nifty50_2019_month = pd.DataFrame([Mean, Median, StdDev, Variance])
nifty50_2019_month.index = ['Mean', 'Median', 'StdDev', 'Variance']
nifty50_2019_month.T

                   Mean     Median      StdDev      Variance
Month
April      11666.452632  11665.950   65.824517   4332.867076
August     10976.500000  11007.175   97.097806   9427.983947
December   12096.880952  12086.700  134.226928  18016.868119
February   10833.840000  10819.025  119.606867  14305.802526
January    10809.463043  10821.600   92.241175   8508.434368
July       11523.110870  11555.900  260.085388  67644.409308
June       11839.023684  11841.550  115.116579  13251.826769
March      11317.242105  11354.250  223.401346  49908.161462
May        11592.022727  11683.075  279.155921  77928.028268
November   11964.132500  11940.700   84.216057   7092.344283
October    11490.205000  11523.300  217.418539  47270.821289
September  11124.289474  11003.500  310.891386  96653.453772

In [47]:
#ques_6
#On the days in which NIFTY50 closed higher than the open, what was the mean of (close - open) for NIFTYNext50

niftynext50_2019['Differ'] = niftynext50_2019['Close'] - niftynext50_2019['Open']
niftynext50_2019[nifty50_2019['Close'] > nifty50_2019['Open']]['Differ'].mean()

118.70188679245271

In [80]:
#ques_7
#In 2019, how many days had the day's high lower than the previous day's low in NIFTY50

n = nifty50_2019[:-1]['High'].values < nifty50_2019[1:]['Low'].values
count = 0
for i in n:
  if (i == True):
    count += 1
count

7

In [105]:
#ques8
#In 2019, on how many days did the day's close exceed the 30 day moving average in NIFTY50 (exclude first month)

nifty50_2019_rev = nifty50_2019.iloc[::-1]    #reversing the dataframe
close_roll = nifty50_2019_rev['Close'].rolling(30).mean()
#class_roll = close_roll.dropna()
np.sum(nifty50_2019_rev['Close'].values[29:] > close_roll.dropna().values)

# new_nifty50_rev[new_nifty50_rev.Close > new_nifty50_rev.rolling(30).mean().Close].Close.count()   #one-line ans

140